configuration/Catalogs/_Команды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_Команды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._КомандыГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарточки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеРоли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФункциональнаяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособГруппировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef._СпособыГруппировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/InformationRegisters/_СостояниеКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_СостояниеКарточек</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД_Элемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/Enums/_ОбработчикиПравил.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>_ОбработчикиПравил</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтандартнаяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Enums/_ВариантыДвиженийДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>_ВариантыДвиженийДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДатойДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущимВременем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Documents/_ДвиженияКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>_ДвиженияКарточки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister._СостояниеКарточек</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженийДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ВариантыДвиженийДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Карточка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД_Элемента</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАктивно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

configuration/Catalogs/_Правила.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_Правила</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ОбработчикиПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьГруппыУсловий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРоли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарточки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункциональнаяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизитаДополнение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сравнение_1</Name>
							<Type>
								<v8:Type>cfg:EnumRef._ВариантыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сравнение_2</Name>
							<Type>
								<v8:Type>cfg:EnumRef._ВариантыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункциональнаяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие_ФункциональнаяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/Catalogs/_Команды/Ext/ManagerModule.bsl
Функция ПолучитьДоступныеКоманды(Отбор,МенеджерВременныхТаблиц=Неопределено) Экспорт
	Возврат Справочники._Правила.ПолучитьДоступныеКоманды(Отбор,МенеджерВременныхТаблиц);
КонецФункции

Процедура ВыполнитьКоманду(Отказ,ОтборПоискаПравил) Экспорт
	//МассивОтборовДляИсполненияПравил = новый Массив;
	Если  ТипЗнч(ОтборПоискаПравил) =Тип("Структура")
		И ОтборПоискаПравил.Свойство("Карточки")
		И ОтборПоискаПравил.Свойство("Команды")
		И ТипЗнч(ОтборПоискаПравил.Команды) = Тип("Массив")
		И ОтборПоискаПравил.Команды.Количество() >= 1 
	Тогда
		//МассивОтборовДляИсполненияПравил.Добавить(Новый Структура("Команда,Карточка",Команда,Отбор.Карточка));
	Иначе
	    ВызватьИсключение "Параметр ""Отбор"" должен содержать заполненный массив ""Карточки"".";
		//Не умею
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//
	//Для каждого ОтборДляИсполненияПравила из МассивОтборовДляИсполненияПравил Цикл
		СписокНайденныхПравил = Справочники._Правила.ПолучитьДоступныеПравила(ОтборПоискаПравил);
		Если СписокНайденныхПравил.Количество()=1 Тогда
			Если СписокНайденныхПравил[0].Обработчик = Перечисления._ОбработчикиПравил.СтандартнаяОбработка Тогда
				//ОтборДляИсполненияПравила = Новый Структура("Команда,Карточка",ОтборПоискаПравил.Команды[0],ОтборПоискаПравил.Карточки[0].Карточки[0]);
				СтандартнаяОбработкаКоманды(Отказ,СписокНайденныхПравил[0],ОтборПоискаПравил);
			Иначе
				ВызватьИсключение "Не указан обработчик. Выполнение команды сброшено.";
				//Не умею
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
			
		Иначе
			//Не буду выполнять несколько правил по одной команде
			Отказ = Истина;
			ВызватьИсключение "Для выполнения команды найдено ноль или больше одного правила. Выполнение команды сброшено.";
			Возврат;
		КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

Процедура СтандартнаяОбработкаКоманды(Отказ, Правило, ОтборПоискаПравил)

    // 1. Получаю текущее состояние для каждой карточки отдельно
    // Соответствие(Карточка) -> Соответствие(ВидРеквизита) -> Массив -> Структура ("УИД_Элемента,ЗначениеРеквизита")
    ТекущееСостояние_Карточка_ВидРеквизита = Новый Соответствие;

    Для Каждого ГруппаРолей Из ОтборПоискаПравил.Карточки Цикл
        Для Каждого времКарточка Из ГруппаРолей.Карточки Цикл

            // Пропускаем, если состояние этой карточки уже загружено
            // (карточка может быть в нескольких группах ролей)
            Если ТекущееСостояние_Карточка_ВидРеквизита.Получить(времКарточка) <> Неопределено Тогда
                Продолжить;
            КонецЕсли;

            ОтборДляЗапросаТекущегоСостояния = Новый Структура("Карточка", времКарточка);
            ТекущееСостояниеМассивом = РегистрыСведений._СостояниеКарточек.ПолучитьСостояние(ОтборДляЗапросаТекущегоСостояния);

            ствЗначенияРеквизитов = Новый Соответствие;
            Для Каждого ЭлементСостояния Из ТекущееСостояниеМассивом Цикл
				НайденныйЭлемент = ствЗначенияРеквизитов.Получить(ЭлементСостояния.ВидРеквизита);
				Если НайденныйЭлемент = Неопределено Тогда
					ствЗначенияРеквизитов.Вставить(ЭлементСостояния.ВидРеквизита, Новый Массив);
				КонецЕсли;
				
				ствЗначенияРеквизитов[ЭлементСостояния.ВидРеквизита].Добавить(
					Новый Структура ("УИД_Элемента,ЗначениеРеквизита,ЗначениеАктивно"
						,ЭлементСостояния.УИД_Элемента
						,ЭлементСостояния.ЗначениеРеквизита
						,ИСТИНА
					)
				);
            КонецЦикла;

            ТекущееСостояние_Карточка_ВидРеквизита.Вставить(времКарточка, ствЗначенияРеквизитов);

        КонецЦикла;
    КонецЦикла;

    // 2. Вычисляю новые значения реквизитов
    тзДвижений = Новый ТаблицаЗначений;
    тзДвижений.Колонки.Добавить("ВидРеквизита");
    тзДвижений.Колонки.Добавить("Карточка");
    тзДвижений.Колонки.Добавить("УИД_Элемента");
    тзДвижений.Колонки.Добавить("ЗначениеРеквизита");
    тзДвижений.Колонки.Добавить("ЗначениеАктивно");

	Для Каждого СтрокаДействия Из Правило.Действия Цикл

	    // Проверка: функциональная роль действия должна быть заполнена
	    Если Не ЗначениеЗаполнено(СтрокаДействия.ФункциональнаяРоль) Тогда
	        ВызватьИсключение "В правиле """ + Правило.Наименование 
	            + """ найдено действие без заполненной функциональной роли. Выполнение команды невозможно.";
	    КонецЕсли;

	    // Для каждого действия ищем группу карточек с соответствующей функциональной ролью
	    Для Каждого ГруппаРолей Из ОтборПоискаПравил.Карточки Цикл

            // Сравниваем функциональную роль действия с ролью группы
            Если СтрокаДействия.ФункциональнаяРоль <> ГруппаРолей.ФункциональнаяРоль Тогда
                Продолжить;
            КонецЕсли;

            // Применяем действие к каждой карточке в данной группе
            Для Каждого КарточкаРедактируемая Из ГруппаРолей.Карточки Цикл

            ТекущееСостояние_Карточки = ТекущееСостояние_Карточка_ВидРеквизита.Получить(КарточкаРедактируемая);
            Если ТекущееСостояние_Карточки = Неопределено Тогда
            	Продолжить;
			КонецЕсли;
				
			Если СтрокаДействия.Действие = Справочники._Действия.ДобавитьЭлементПоФункциональнойРоли Тогда
					//Ищу функциональную роль источник значения
					Для Каждого данныеФункциональнойРоли_Источника Из ОтборПоискаПравил.Карточки Цикл
		            Если данныеФункциональнойРоли_Источника.ФункциональнаяРоль <> СтрокаДействия.Действие_ФункциональнаяРоль Тогда
		                Продолжить;
					КонецЕсли;
					Для каждого Карточка_ИсточникДанных ИЗ данныеФункциональнойРоли_Источника.Карточки Цикл
            			Состояние_КарточкиИсточникаДанных = ТекущееСостояние_Карточка_ВидРеквизита.Получить(Карточка_ИсточникДанных);
			            мЗначенийРеквизита_ИсточникДанных = Состояние_КарточкиИсточникаДанных.Получить(СтрокаДействия.ЗначениеРеквизита); //в поле ЗначениеРеквизита хранится видРеквизита из карточкиИсточникаДанных
						Для Каждого струкЗначениеРеквизита_ИсточникДанных ИЗ мЗначенийРеквизита_ИсточникДанных Цикл
			                ЗначениеРеквизитаИсточникаДанных = струкЗначениеРеквизита_ИсточникДанных.ЗначениеРеквизита;
						КонецЦикла;
					КонецЦикла;
					КонецЦикла;
					
	                РедактируемыеИзмерения = Новый Структура("Карточка,ВидРеквизита,УИД_Элемента");
	                РедактируемыеИзмерения.Вставить("Карточка", КарточкаРедактируемая);
	                РедактируемыеИзмерения.Вставить("ВидРеквизита", СтрокаДействия.ВидРеквизита);
	                РедактируемыеИзмерения.Вставить("УИД_Элемента", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") ); // пусть документ _ДвиженияКарточки сам определит УИД
					
					стрДвижение = НоваяСтрока_тзДвижений(тзДвижений, ТекущееСостояние_Карточка_ВидРеквизита
					, РедактируемыеИзмерения
					,ЗначениеРеквизитаИсточникаДанных
					);
					//стрДвижение.ЗначениеРеквизита = ЗначениеРеквизитаИсточникаДанных;
					
					//Нужно придумать, как редактировать ТекущееСостояние_Карточки
					//ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита, стрДвижение.ЗначениеРеквизита);
			КонецЕсли;
			
            // Применяю действие к каждому элементу, для списочных реквизитов будет массив
            мЗначенийРеквизита = ТекущееСостояние_Карточки.Получить(СтрокаДействия.ВидРеквизита);
			Для Каждого струЗначениеРеквизита ИЗ мЗначенийРеквизита Цикл 

                ТекущееЗначениеРеквизита = струЗначениеРеквизита.ЗначениеРеквизита;

                РедактируемыеИзмерения = Новый Структура("Карточка,ВидРеквизита,УИД_Элемента");
                РедактируемыеИзмерения.Вставить("Карточка", КарточкаРедактируемая);
                РедактируемыеИзмерения.Вставить("ВидРеквизита", СтрокаДействия.ВидРеквизита);
                РедактируемыеИзмерения.Вставить("УИД_Элемента", струЗначениеРеквизита.УИД_Элемента);

                Если СтрокаДействия.Действие = Справочники._Действия.Установить Тогда
					стрДвижение = НоваяСтрока_тзДвижений(тзДвижений, ТекущееСостояние_Карточка_ВидРеквизита
					, РедактируемыеИзмерения
					,СтрокаДействия.ЗначениеРеквизита
					);
					//стрДвижение.ЗначениеРеквизита = СтрокаДействия.ЗначениеРеквизита;
					//ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита, стрДвижение.ЗначениеРеквизита);
 					
				ИначеЕсли СтрокаДействия.Действие = Справочники._Действия.УбратьЭлемент Тогда
					// !!! Не тестировал
					стрДвижение = НоваяСтрока_тзДвижений(тзДвижений, ТекущееСостояние_Карточка_ВидРеквизита
					, РедактируемыеИзмерения
					,ТекущееЗначениеРеквизита
					,ЛОЖЬ //ЗначениеАктивно
					);
					//стрДвижение.ЗначениеАктивно = ЛОЖЬ;
					//ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита, стрДвижение.ЗначениеРеквизита);

                ИначеЕсли СтрокаДействия.Действие = Справочники._Действия.Прибавить Тогда
					стрДвижение = НоваяСтрока_тзДвижений(тзДвижений, ТекущееСостояние_Карточка_ВидРеквизита
					, РедактируемыеИзмерения
					,ТекущееЗначениеРеквизита + СтрокаДействия.ЗначениеРеквизита
					);
					//стрДвижение.ЗначениеРеквизита = ТекущееЗначениеРеквизита + СтрокаДействия.ЗначениеРеквизита;
					//ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита, стрДвижение.ЗначениеРеквизита);

                ИначеЕсли СтрокаДействия.Действие = Справочники._Действия.Вычесть Тогда
					стрДвижение = НоваяСтрока_тзДвижений(тзДвижений, ТекущееСостояние_Карточка_ВидРеквизита
					, РедактируемыеИзмерения
					,ТекущееЗначениеРеквизита - СтрокаДействия.ЗначениеРеквизита
					);
					//стрДвижение.ЗначениеРеквизита = ТекущееЗначениеРеквизита - СтрокаДействия.ЗначениеРеквизита;
					//ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита, стрДвижение.ЗначениеРеквизита);

                ИначеЕсли СтрокаДействия.Действие = Справочники._Действия.Максимум Тогда
					// СтрокаДействия.ЗначениеРеквизита - это максимальный предел, поэтому проверка на минимум
					ВычисленноеЗначениеРеквизита = Мин(ТекущееЗначениеРеквизита, СтрокаДействия.ЗначениеРеквизита);
					стрДвижение = НоваяСтрока_тзДвижений(тзДвижений, ТекущееСостояние_Карточка_ВидРеквизита
					, РедактируемыеИзмерения
					,ВычисленноеЗначениеРеквизита
					);
					//ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита, стрДвижение.ЗначениеРеквизита);

                ИначеЕсли СтрокаДействия.Действие = Справочники._Действия.Минимум Тогда
					// СтрокаДействия.ЗначениеРеквизита - это Минимальный предел, поэтому проверка на максимум
					ВычисленноеЗначениеРеквизита = Макс(ТекущееЗначениеРеквизита, СтрокаДействия.ЗначениеРеквизита);
					стрДвижение = НоваяСтрока_тзДвижений(тзДвижений, ТекущееСостояние_Карточка_ВидРеквизита
					, РедактируемыеИзмерения
					,ВычисленноеЗначениеРеквизита
					);                	
					//стрДвижение.ЗначениеРеквизита = Мин(ТекущееЗначениеРеквизита, СтрокаДействия.ЗначениеРеквизита);
                	//ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита, стрДвижение.ЗначениеРеквизита);

				ИначеЕсли СтрокаДействия.Действие = Справочники._Действия.УстановитьИзФункциональнойРоли Тогда
					//Ищу функциональную роль источник значения
					Для Каждого данныеФункциональнойРоли_Источника Из ОтборПоискаПравил.Карточки Цикл
		            Если данныеФункциональнойРоли_Источника.ФункциональнаяРоль <> СтрокаДействия.Действие_ФункциональнаяРоль Тогда
		                Продолжить;
					КонецЕсли;
					Для каждого Карточка_ИсточникДанных ИЗ данныеФункциональнойРоли_Источника.Карточки Цикл
            			Состояние_КарточкиИсточникаДанных = ТекущееСостояние_Карточка_ВидРеквизита.Получить(Карточка_ИсточникДанных);
			            мЗначенийРеквизита_ИсточникДанных = Состояние_КарточкиИсточникаДанных.Получить(СтрокаДействия.ЗначениеРеквизита); //в поле ЗначениеРеквизита хранится видРеквизита из карточкиИсточникаДанных
						Для Каждого струкЗначениеРеквизита_ИсточникДанных ИЗ мЗначенийРеквизита_ИсточникДанных Цикл
			                ЗначениеРеквизитаИсточникаДанных = струкЗначениеРеквизита_ИсточникДанных.ЗначениеРеквизита;
						КонецЦикла;
					КонецЦикла;
					КонецЦикла;
					
					стрДвижение = НоваяСтрока_тзДвижений(тзДвижений, ТекущееСостояние_Карточка_ВидРеквизита
					, РедактируемыеИзмерения
					,ЗначениеРеквизитаИсточникаДанных
					);
					
					//Нужно придумать, как редактировать ТекущееСостояние_Карточки
					//ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита, стрДвижение.ЗначениеРеквизита);

				ИначеЕсли СтрокаДействия.Действие = Справочники._Действия.УбратьЭлементПоФункциональнойРоли Тогда
					й=1;
					//Ищу функциональную роль источник значения
					Для Каждого данныеФункциональнойРоли_Источника Из ОтборПоискаПравил.Карточки Цикл
		            Если данныеФункциональнойРоли_Источника.ФункциональнаяРоль <> СтрокаДействия.Действие_ФункциональнаяРоль Тогда
		                Продолжить;
					КонецЕсли;
					
					Для каждого Карточка_ИсточникДанных ИЗ данныеФункциональнойРоли_Источника.Карточки Цикл
						Состояние_КарточкиИсточникаДанных = ТекущееСостояние_Карточка_ВидРеквизита.Получить(Карточка_ИсточникДанных);
			            мЗначенийРеквизита_ИсточникДанных = Состояние_КарточкиИсточникаДанных.Получить(СтрокаДействия.ЗначениеРеквизита);
						Для Каждого струкЗначениеРеквизита_ИсточникДанных ИЗ мЗначенийРеквизита_ИсточникДанных Цикл 
			                ЗначениеРеквизитаИсточникаДанных = струкЗначениеРеквизита_ИсточникДанных.ЗначениеРеквизита;
							Если ЗначениеРеквизитаИсточникаДанных<>струЗначениеРеквизита.ЗначениеРеквизита Тогда 
								// вызывается для каждого элемента списочных реквизитов редактируемого вида
								// ??? Может быть убрать из цикла перебора элементов
								Продолжить; // не наш случай
							КонецЕсли;
							
							стрДвижение = НоваяСтрока_тзДвижений(тзДвижений, ТекущееСостояние_Карточка_ВидРеквизита
							, РедактируемыеИзмерения
							,ЗначениеРеквизитаИсточникаДанных
							,ЛОЖЬ //ЗначениеАктивно
							);
							//стрДвижение.ЗначениеРеквизита = ЗначениеРеквизитаИсточникаДанных;
							//стрДвижение.ЗначениеАктивно = ЛОЖЬ;

							//Нужно придумать, как редактировать ТекущееСостояние_Карточки 
							//ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита, стрДвижение.ЗначениеРеквизита);
						КонецЦикла;
					КонецЦикла;
					КонецЦикла;
                КонецЕсли;

            КонецЦикла; // Для каждого элемента списочных реквизитов
            КонецЦикла; // Для каждой карточки в группе роли

        КонецЦикла; // Для каждой группы ролей

    КонецЦикла; // Для каждого действия

    // 3. Запоминаю вычисленные значения реквизитов
    ДокументДвижения = Документы._ДвиженияКарточки.СоздатьДокумент();
    ДокументДвижения.Дата = ТекущаяДатаСеанса();
	ДокументДвижения.ВариантДвиженийДокумента = Перечисления._ВариантыДвиженийДокумента.ТекущимВременем;

    Для Каждого стрДвижение Из тзДвижений Цикл
		стрТЧ_Движение = ДокументДвижения.Реквизиты.Добавить();
		стрТЧ_Движение.Карточка = стрДвижение.Карточка;
		стрТЧ_Движение.ВидРеквизита = стрДвижение.ВидРеквизита;
		стрТЧ_Движение.УИД_Элемента = стрДвижение.УИД_Элемента;
		стрТЧ_Движение.ЗначениеРеквизита = стрДвижение.ЗначениеРеквизита;
		стрТЧ_Движение.ЗначениеАктивно = стрДвижение.ЗначениеАктивно;
    КонецЦикла;

    ДокументДвижения.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

//
//
// МассивТекущихЗначений - Соответствие(Карточка) -> Соответствие(ВидРеквизита) -> Массив -> Структура ("УИД_Элемента,ЗначениеРеквизита")
Функция НоваяСтрока_тзДвижений(тзДвижений, МассивТекущихЗначений, ЗначенияИзмерений,ЗначениеРеквизита,ЗначениеАктивно = ИСТИНА)
	//1. заполняю строку движения
	НайденныеСтроки_тзДвижений = _КлиентСервер.НайтиСтрокиВТЗ(тзДвижений, ЗначенияИзмерений);
	
	Если НайденныеСтроки_тзДвижений.Количество() > 0 Тогда
		стрДвижение = НайденныеСтроки_тзДвижений[0];
	Иначе
		стрДвижение = тзДвижений.Добавить();
	КонецЕсли;
	
	стрДвижение.Карточка     = ЗначенияИзмерений.Карточка;
	стрДвижение.ВидРеквизита = ЗначенияИзмерений.ВидРеквизита;
	стрДвижение.УИД_Элемента = ЗначенияИзмерений.УИД_Элемента;
	
	стрДвижение.ЗначениеРеквизита = ЗначениеРеквизита;
	стрДвижение.ЗначениеАктивно   = ЗначениеАктивно;
	
	СостояниеКарточки = МассивТекущихЗначений[стрДвижение.Карточка];
	МассивЗначенийРеквизита = СостояниеКарточки[ЗначенияИзмерений.ВидРеквизита];
	
	Если МассивЗначенийРеквизита =Неопределено Тогда
		МассивЗначенийРеквизита = Новый Массив;
		СостояниеКарточки.вставить(ЗначенияИзмерений.ВидРеквизита,МассивЗначенийРеквизита);	
	КонецЕсли;
	
	//2. Запоминаю новое значение в МассивТекущихЗначений
	ЗначениеУстановлено = ЛОЖЬ;
	Для Каждого ЭлементЗначения Из МассивЗначенийРеквизита Цикл
		Если ЭлементЗначения.УИД_Элемента = стрДвижение.УИД_Элемента Тогда
			ЭлементЗначения.ЗначениеРеквизита = стрДвижение.ЗначениеРеквизита;
			ЭлементЗначения.ЗначениеАктивно   = стрДвижение.ЗначениеАктивно;
			ЗначениеУстановлено = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеУстановлено = ЛОЖЬ Тогда
		ЭлементЗначения = Новый Структура ("УИД_Элемента,ЗначениеРеквизита,ЗначениеАктивно") ;
		ЭлементЗначения.ЗначениеРеквизита = стрДвижение.ЗначениеРеквизита;
		ЭлементЗначения.ЗначениеАктивно   = стрДвижение.ЗначениеАктивно;
		МассивЗначенийРеквизита.Добавить(ЭлементЗначения);	
		ЗначениеУстановлено = Истина;
	КонецЕсли;
	
	//3. Возврат
	Возврат стрДвижение; 
КонецФункции

Процедура СТАРАЯ_СтандартнаяОбработкаКоманды(Отказ,Правило,ОтборДляПоискаПравил)
	
	//1. Получаю текущее сотояние
	Если ТипЗнч(ОтборДляПоискаПравил) =Тип("Структура") И ОтборДляПоискаПравил.Свойство("Карточка") Тогда
		ОтборДляЗапросаТекущегоСостояния = Новый Структура("Карточка",ОтборДляПоискаПравил.Карточка);
		ТекущееСостояниеМассивом = РегистрыСведений._СостояниеКарточек.ПолучитьСостояние(ОтборДляЗапросаТекущегоСостояния);
		ТекущееСостояние_Карточка_ВидРеквизита = новый Соответствие; // Запоминаю значения в разрезе Карточка_ВидРеквизита, т.к. планирую организовать сложное условие поиска правил, где будут указываться роли для карточек
		текКарточка ="НевозможноеЗначение";
		Для Каждого ТекущееСостояние_Элемент ИЗ ТекущееСостояниеМассивом Цикл
			Если текКарточка <> ТекущееСостояние_Элемент.Карточка Тогда
				текКарточка = ТекущееСостояние_Элемент.Карточка;
				ТекущееСостояние_Карточка_ВидРеквизита.Вставить(текКарточка,новый Соответствие);
				ТекущееСостояние_Карточки = ТекущееСостояние_Карточка_ВидРеквизита.Получить(текКарточка);
			КонецЕсли;	
			ТекущееСостояние_Карточки.Вставить(ТекущееСостояние_Элемент.ВидРеквизита,ТекущееСостояние_Элемент.ЗначениеРеквизита);
		КонецЦикла;
	Иначе
		//Не умею
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//2. Вычисляю новые значения реквизитов
	тзДвижений = новый ТаблицаЗначений;
	тзДвижений.Колонки.Добавить("ВидРеквизита");
	тзДвижений.Колонки.Добавить("Карточка");
	тзДвижений.Колонки.Добавить("УИД_Элемента");
	тзДвижений.Колонки.Добавить("ЗначениеРеквизита");
	тзДвижений.Колонки.Добавить("ЗначениеАктивно");

	Для каждого СтрокаДействия ИЗ Правило.Действия Цикл
		ТекущееСостояние_Карточки = ТекущееСостояние_Карточка_ВидРеквизита.Получить(ОтборДляПоискаПравил.Карточка);
		ТекущееЗначениеРеквизита = ТекущееСостояние_Карточки.Получить(СтрокаДействия.ВидРеквизита);
		
		Отбор = Новый Структура ("ВидРеквизита,Карточка,УИД_Элемента");
		Отбор.Вставить("Карточка",ОтборДляПоискаПравил.Карточка);
		Отбор.Вставить("ВидРеквизита",СтрокаДействия.ВидРеквизита);
		Отбор.Вставить("УИД_Элемента","");
		НайденныеСтроки_тзДвижений = _КлиентСервер.НайтиСтрокиВТЗ(тзДвижений,Отбор);
		
		Если НайденныеСтроки_тзДвижений.Количество()>0 Тогда
			стрДвижение = НайденныеСтроки_тзДвижений[0];
		Иначе 
			стрДвижение = тзДвижений.Добавить();
		КонецЕсли;
		стрДвижение.Карточка = ОтборДляПоискаПравил.Карточка;
		стрДвижение.ВидРеквизита = СтрокаДействия.ВидРеквизита;
		стрДвижение.УИД_Элемента = "";
		

		Если СтрокаДействия.Действие=Справочники._Действия.Установить Тогда
			стрДвижение.ЗначениеРеквизита = СтрокаДействия.ЗначениеРеквизита;
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		ИначеЕсли СтрокаДействия.Действие=Справочники._Действия.Прибавить Тогда
			стрДвижение.ЗначениеРеквизита = ТекущееЗначениеРеквизита + СтрокаДействия.ЗначениеРеквизита;
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		ИначеЕсли СтрокаДействия.Действие=Справочники._Действия.Вычесть Тогда
			стрДвижение.ЗначениеРеквизита = ТекущееЗначениеРеквизита - СтрокаДействия.ЗначениеРеквизита;
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		ИначеЕсли СтрокаДействия.Действие=Справочники._Действия.Максимум Тогда
			стрДвижение.ЗначениеРеквизита = Макс(ТекущееЗначениеРеквизита, СтрокаДействия.ЗначениеРеквизита);
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		ИначеЕсли СтрокаДействия.Действие=Справочники._Действия.Минимум Тогда
			стрДвижение.ЗначениеРеквизита = Мин(ТекущееЗначениеРеквизита, СтрокаДействия.ЗначениеРеквизита);
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	//3. запоминаю вычесленные значения реквизитов
	ДокументДвижения = Документы._ДвиженияКарточки.СоздатьДокумент();
	ДокументДвижения.Дата = ТекущаяДатаСеанса();
	ДокументДвижения.ВариантДвиженийДокумента = Перечисления._ВариантыДвиженийДокумента.ТекущимВременем;
	Для каждого стрДвижение ИЗ тзДвижений Цикл
		стрТЧ_Движение = ДокументДвижения.Реквизиты.Добавить();
		стрТЧ_Движение.Карточка = стрДвижение.Карточка;
		стрТЧ_Движение.ВидРеквизита = стрДвижение.ВидРеквизита;
		стрТЧ_Движение.УИД_Элемента = Неопределено; // Нужно решить вопрос со списочными видами реквизитов
		стрТЧ_Движение.ЗначениеРеквизита = стрДвижение.ЗначениеРеквизита;
		стрТЧ_Движение.ЗначениеАктивно = ИСТИНА;
	КонецЦикла;
	
	ДокументДвижения.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
